constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
phases (water air);

water
{ // 1000 PPM PAM
      parameters
       {		        
         type             Oldroyd-BLog;
         rho              rho [ 1 -3 0 0 0 0 0 ] 997.2;
         etaS             etaS [1 -1 -1 0 0 0 0] 0.00083;
         etaP             etaP [1 -1 -1 0 0 0 0] 0.00184;  
         lambda           lambda [0 0 1 0 0 0 0] 0.0065;
         
         stabilization    coupling;
       }
}

air
{
     parameters
       {		        
         type            Newtonian;
         rho             rho [1 -3 0 0 0 0 0] 1;
         eta             eta [1 -1 -1 0 0 0 0] 1e-5; 
       }
}
 

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.074;

// ************************************************************************* //
