system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (0 0 0)
);

regions
(

    cylinderToCell
    {
      
        p1       (0 0.013 -.6); 
        p2       (0 0.013 .6);
        radius   0.00135;
        
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volVectorFieldValue U (0 -1.4124 0)
        ); 
    }

);

// ************************************************************************* //
